#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/northernelephant/apiv6/runs/run-p1s16rEv4xJjPuxN

Waiting for the plan to start...

Terraform v1.3.2
on linux_amd64
Initializing plugins and modules...
aws_dynamodb_table.apiv6-uat: Refreshing state... [id=apiv6-uat]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_dynamodb_table.apiv6-uat has been deleted
  - resource "aws_dynamodb_table" "apiv6-uat" {
      - arn            = "arn:aws:dynamodb:us-east-1:767653220718:table/apiv6-uat" -> null
      - id             = "apiv6-uat" -> null
        name           = "apiv6-uat"
        # (7 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.apiv6-uat will be created
  + resource "aws_dynamodb_table" "apiv6-uat" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "band"
      + id               = (known after apply)
      + name             = "apiv6-uat"
      + range_key        = "title"
      + read_capacity    = 10
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 10

      + attribute {
          + name = "band"
          + type = "S"
        }
      + attribute {
          + name = "title"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = false
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = "expiryPeriod"
          + enabled        = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ arn = "arn:aws:dynamodb:us-east-1:767653220718:table/apiv6-uat" -> (known after apply)
  ~ id  = "apiv6-uat" -> (known after apply)

```
</details>
*Pusher: @monk78anthony, Action: `pull_request`*